@lorinw  I tried in bigip 15.0.1 and didn't see the issue and below is the config.
Can you clone the latest repo and just try only monitor resource with below config, to see the issue coming or not ?

$ cat test.tf 

provider "bigip" {
  address  = "xxxxx"
  username = "xxxx"
  password = "xxx"
}


resource "bigip_ltm_monitor" "monitor" {
  name       = "/Common/terraform_monitor1"
  parent     = "/Common/http"
  send       = "GET /some/path123\r\n"
  timeout    = "100"
  interval   = "30"
  destination = "*:7003"
}

-----------------------------------------------------------------------------------------------------------------
$ terraform init

Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_monitor.monitor will be created
  + resource "bigip_ltm_monitor" "monitor" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = (known after apply)
      + destination    = "*:7003"
      + id             = (known after apply)
      + interval       = 30
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/terraform_monitor1"
      + parent         = "/Common/http"
      + reverse        = (known after apply)
      + send           = "GET /some/path123\\r\\n"
      + time_until_up  = (known after apply)
      + timeout        = 100
      + transparent    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_monitor.monitor: Creating...
bigip_ltm_monitor.monitor: Creation complete after 7s [id=/Common/terraform_monitor1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.




![image](https://user-images.githubusercontent.com/48274565/92620490-5459f880-f2e0-11ea-9b3f-34478c341444.png)



![image](https://user-images.githubusercontent.com/48274565/92619898-aea68980-f2df-11ea-8e1f-8da9de9aaab1.png)
